config.org
#+TITLE: Config
#+STARTUP: overview
#+PROPERTY: header-args :results none :tangle yes

* Intro
- Latest Doom private config file templates are [[https://github.com/doomemacs/doomemacs/tree/594d70292dc134d483fbf7a427001250de07b4d2/templates][here]]. Diff =init.el= to see what's new.
* Ideas
- Change image paste directory structure for org image download set so that it works in the same directory structure as logseq? see image green propulsion file [2021-12-13 Mon]
- Halp runs programs in the Emacs buffer holding their source, seeing their output inline, interactively. Probably not necessary with org-mode, which has literate programming built in.
   =(load! "~/.doom.d/modules/halp.el")=
- If emacs path is not the same is not the same as Mac path, try [[https://github.com/purcell/exec-path-from-shell][this.]]

* Startup and load

Required first line for =config.el=.
#+begin_src emacs-lisp
;;; config.el -*- lexical-binding: t; -*-
#+end_src

#+begin_src emacs-lisp
;; Start the Emacs server from this instance so that all emacsclient calls are routed here.
;; (if (server-running-p ()) nil (server-start))

;; To reduce the risk of loading outdated byte code files, set load-prefer-newer
;; and enable auto-compile-on-load-mode as early as possible.
(auto-compile-on-load-mode)
(auto-compile-on-save-mode)
(setq load-prefer-newer t)

(load! "my/global/functions.el")

(setq
  shell-file-name "/opt/homebrew/bin/fish"
  mac-right-command-modifier 'hyper
  trash-directory "~/.Trash"
  confirm-kill-emacs nil ; Disable exit confirmation

  user-full-name "Gavin Hughes"
  user-mail-address "gavhug@gmail.com"

  doom-scratch-initial-major-mode 'org-mode
  undo-limit 80000000                         ; Raise undo-limit to 80Mb
  evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
  auto-save-default t
  inhibit-compacting-font-caches t            ; When there are lots of glyphs, keep them in memory
  truncate-string-ellipsis "…"                ; Use unicode ellipsis
  global-visual-line-mode t                   ; Visual line navigation everywhere.

  display-line-numbers-type 'visual

  ;; Finder "put back" is not supported. If desired, instructions are here
  ;; https://christiantietze.de/posts/2021/06/emacs-trash-file-macos/
  delete-by-moving-to-trash t

  ;; https://github.com/jschaf/esup/issues/54
  ;; work around a bug where esup tries to step into the byte-compiled
  ;; version of `cl-lib', and fails horribly.
  esup-depth 0
  )

;; Use evil in minibuffer to support 'gh/consult-ripgrep-tag
;; to delete backwards and add \#tag.
;; TODO Why do we need evil for this? Any other value for having evil in minibuffer?
(setq evil-want-minibuffer t)

;; Don't use locate, only consult-locate.
(setq consult-locate-args "mdfind -name") ;; Instead of `locate`
;; Would be better to have the below, but need to figure out how to do it.
;; (setq consult-locate-args (concat "mdfind " args " | grep -v -e /bak/ -e archive"))

;; Spelling
(setq-default ispell-program-name "aspell")
(setq-default ispell-extra-args '("--sug-mode=ultra"))

;; suggested by ai
;; Initially, toggle spell-checking on
;; (add-hook 'text-mode-hook #'flyspell-mode)
;; (add-hook 'prog-mode-hook #'flyspell-prog-mode)

;; Commented on [2023-04-30 Sun]
;; (remove-hook 'text-mode-hook #'spell-fu-mode) ; Focus on writing, not spelling.
(setq
   ispell-personal-dictionary "~/.doom.d/aspell.en.pws"
   ;; ispell-program-name "hunspell"
   )

;; [2023-01-17 Tue] I think I fixed this by adding "*archive" to to gitignore global and using ripgrep for searching.
;; (setq projectile-indexing-method 'native)
;; (add-to-list 'projectile-globally-ignored-file-suffixes ".org_archive")
;; (add-to-list 'projectile-globally-ignored-directories "*bak")
;; https://emacs.stackexchange.com/questions/16497/how-to-exclude-files-from-projectile

;; ‘nil’ sets major mode to equal previous current buffer.
(setq-default major-mode 'org-mode)

(add-to-list 'default-frame-alist '(fullscreen . maximized)) ; Maximize frame at startup
#+end_src

* Themes and font
- My themes are in $DOOMDIR/themes.

** Toggle light/dark themes
#+begin_src emacs-lisp
(defvar dark-theme  'gav-one)
(defvar light-theme 'gav-one-light)
(defun toggle-theme ()
  "Toggle between my light and dark themes."
  (interactive)
  (if (eq (car custom-enabled-themes) dark-theme)
      (load-theme light-theme)
    (load-theme dark-theme)))
#+end_src

*** Ideas
- You could also try setting when the system inverts colors. This would get you started but needs to be changed for invert, not mode:
    https://www.reddit.com/r/emacs/comments/hejsqm/is_there_a_way_to_detect_lightdark_mode_on_mac/
** Font faces and text
#+begin_src emacs-lisp
;; Make text easier to read by increasing space between lines.
(add-hook 'org-mode-hook (lambda () (setq line-spacing 10)))

;; Use word wrap in all buffers that minor mode message-mode.
;; https://blog.jethro.dev/posts/migrating_to_doom_emacs/
(remove-hook 'text-mode-hook #'auto-fill-mode)
(add-hook 'message-mode-hook #'word-wrap-mode)

(add-hook! 'org-mode-hook #'mixed-pitch-mode)
(setq mixed-pitch-variable-pitch-cursor nil)

  ;; Don't spread text across the entire screen.
(advice-add 'text-scale-adjust :after #'visual-fill-column-adjust)
(setq
  visual-fill-column-fringes-outside-margins nil
  visual-fill-column-center-text t
  visual-fill-column-width 100
)
(add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
#+end_src

#+begin_src emacs-lisp
(setq
  doom-font (font-spec :family "DejaVu Sans Mono" :size 16)
  doom-variable-pitch-font (font-spec :family "DejaVu Serif" :size 18)
  doom-serif-font (font-spec :family "DejaVu Serif")
)
#+end_src

Fonts
#+begin_src emacs-lisp
(setq
    org-priority-faces '((?A . (:foreground "dim grey"))
                        (?B . (:foreground "dim grey"))
                        (?C . (:foreground "dim grey")))
    org-todo-keyword-faces
    '(
            ("DOING" :foreground "grey40" :weight bold :family "DejaVu Sans Mono")
            ("ASSIGNED" :foreground "grey40" :weight bold :family "DejaVu Sans Mono")
            ("TODO" :foreground "#98be65" :weight bold :family "DejaVu Sans Mono")
            ("WIP" :foreground "dim grey" :weight bold :family "DejaVu Sans Mono")
            ("DONE" :foreground "grey25" :weight bold :family "DejaVu Sans Mono")
            ("PENDING" :foreground "DarkGreen" :weight bold :family "DejaVu Sans Mono")
            ("PAUSED" :foreground "dim grey" :weight bold :family "DejaVu Sans Mono")
            ("[ ]" :foreground "dim grey")
            ("[X]" :foreground "grey25")
            ("CANCELLED" :foreground "grey25" :weight bold :family "DejaVu Sans Mono"))
   )
#+end_src

#+begin_src emacs-lisp
(custom-theme-set-faces
  'user
  ;; Use only two alternating colors for heading.
  '(org-level-1 ((t (:foreground "systemTealColor" :height 1.15))))
  '(org-level-2 ((t (:weight bold :foreground "systemBrownColor"))))
  '(org-level-3 ((t (:foreground "systemTealColor"))))
  '(org-level-4 ((t (:foreground "systemBrownColor"))))
  '(org-level-5 ((t (:foreground "systemTealColor"))))
  '(org-level-6 ((t (:foreground "systemBrownColor"))))

  ;; Remove bold from links.
  ;; "pink1" is here in search of a solution that would undefine the color on a link
  ;; and inherit.
  '(link ((t (:weight normal :underline "grey37" :foreground "pink1"))))
)
#+end_src
* My functions
** Search
#+begin_src elisp
; Note that filenames containing `archive` anywhere in the path are excluded.
(setq consult-ripgrep-args "rg -g !\*bak -g !\*archive\* --sortr path --null --line-buffered --color=never --max-columns=1000 --path-separator /   --smart-case --no-heading --line-number --multiline --type org .")

(defun gh/consult-ripgrep-org-roam-tag ()
  "Keybinding quick access to consult-ripgrep in the org-roam directory.
Double press search edits to search with escaped tag: \\#tag"
  (interactive)
  (if (minibufferp)
      (progn
        (backward-delete-char 1)
        (insert "\\#"))
    (consult-ripgrep org-roam-directory)))
#+end_src
** Buffers
#+begin_src emacs-lisp
(defun gh/clone-indirect-buffer-vertically ()
  (interactive)
  (clone-indirect-buffer nil 1)
  (+evil/window-move-right))
#+end_src
