config.el
  "H-s"         (cmd! (find-file (expand-file-name "stack.org" org-roam-directory)))
  "H-c"         (cmd! (find-file "/Users/gavinhughes/.doom.d/config.org"))
  "H-\\"        'toggle-theme
  "H-y"         'doom/delete-this-file
  "H-j"         'gh/org-open-journal

   ;; Movement
   :n "$"                  'end-of-visual-line
   :n "j"                  'evil-next-visual-line
   :n "k"                  'evil-previous-visual-line
      "M-<left>"           'backward-word
      "M-<right>"          'forward-word
      "M-s-l"              'avy-goto-char
      "M-s-;"              'avy-goto-char-2
   :i "s-l" "<escape>la" ;; Step forward over single chars without leaving insert mode
   :i "s-h" "<escape>ha" ;; Step back over...
   :i "s-S" "<escape>0i" ;; Jump to col 0. Useful in org mode

   :i "M-o"  'evil-execute-in-normal-state

  :ni "M-."                'better-jumper-jump-forward
  :ni "M-,"                'better-jumper-jump-backward

  ;; Text
      "M-c"                'capitalize-region ; Overwrites capitalize-word (use ~)

  ;; Special characters
  :i "M--" "–" ;; m-dash. Consistent with Mac.

  ;; Buffers
  "s-n"            '+default/new-buffer
  "M-s-k"          'kill-current-buffer
  "M-s-K"          'kill-buffer-and-window
  "s-,"            '+vertico/switch-workspace-buffer
  "M-s-,"          'consult-buffer
  "M-s-]"          'next-buffer
  "M-s-["          'previous-buffer
  "s-p"            'ps-print-buffer-with-confirmation
  "s-;"            'org-roam-node-find
  "M-s-s"          (cmd! (save-buffer) (kill-current-buffer))

  ;; Search
  "s-\\"            'consult-ripgrep
  "M-s-\\"          'gh/consult-ripgrep-org-roam-tag

  ;; Windows
  "s-'"            'evil-window-next
  "s-\""           'evil-window-prev
  "C-S-M-<return>" 'toggle-frame-fullscreen
  ;; Doesn't work in emacs-mac. All frames are maximized.
  ;; "C-M-<return>" 'toggle-frame-maximized

  ;; Workspaces.
  ;; :n assignment is in the package. Add :i.
  ;; [2022-05-22 Sun] Just pulled out the :ni to make this work in the agenda. Any issues??
  "s-1"        '+workspace/switch-to-0
  "s-2"        '+workspace/switch-to-1
  "s-3"        '+workspace/switch-to-2
  "s-4"        '+workspace/switch-to-3

  ;; Org-ai
  "C-c a a"    'gh/orgai-file-append

  ;; Other
  :ni "s-O"       'evil-open-above
      "s-<up>"    '+evil/insert-newline-above
      "s-<down>"  '+evil/insert-newline-below
      ;; Took this out because conflict with minibuffer immediate done on selection.
      ;; "M-<return>"  '+default/newline-below
  ;; was "H-<return>" with the following note:
   ;; todo. write about the reason for this. Has to do with org mode conflict 's-<return>'
  ;; :ni "s-<return>" (cmd! (message "Use <H-return>"))
  :niv "C-u"       'universal-argument

  ;; Make `$` behave same as in :normal.
  :v  "$"         (cmd! (evil-end-of-line) (evil-backward-char) (evil-forward-char))

  ;; Leaders – place last, otherwise errors.
  :leader "f m"   'doom/move-this-file
  :leader "b n"   'rename-buffer
  :leader "b c"   'gh/clone-indirect-buffer-vertically
  :leader "j d"   'dired-jump
  :leader "j j"   (cmd! (find-file "~/Library/Mobile Documents/com~apple~CloudDocs/OrgNotes/Roam/Journal.org"))
  :leader "f d"   'doom/delete-this-file
  :leader "q f"   'delete-frame

  ;; Git
  :leader "g f d"   'magit-diff-buffer-file

  ;; `m` Mac OS
  :leader "m m d"   '+macos/open-in-default-program
  :leader "m m o"   'reveal-in-osx-finder

  ;; `t` Toggle
  :leader "t v"   'visual-fill-column-mode
)

(map! :map minibuffer-local-map
  "s-<return>" "C-; !"
  )

(map! :map org-mode-map
  :ni "C-<return>"  (cmd! (evil-org-org-insert-heading-respect-content-below))
  :ni "s-<return>"         (cmd! (+org/insert-item-below 1))
  :ni "S-s-<return>"     (cmd! (+org/insert-item-above 1))
  :ni "M-s-<return>"       (cmd! (org-insert-subheading 1) (evil-insert 1))
  ;; Insert a heading while currently working a bullet list
  :nie "C-M-s-<return>"     (cmd! (org-previous-visible-heading 1)
                                  (+org/insert-item-below 1))

  "M-s-SPC"            'org-capture

  :n "z n"             'doom/toggle-narrow-to-buffer ; org-tree-to-indirect-buffer
                                                     ; The original might be better?

  "H-n"                'org-next-visible-heading
  "H-p"                'org-previous-visible-heading
  "H-r"                (cmd! (+org/refile-to-file nil "daily.org"))
  "H-R"                '+org/refile-to-file
  ;; "H-a"                'org-archive-subtree
  "H-a"                'gh/open-or-pop-to-agenda

  "C-<"                'org-do-promote
  "C->"                'org-do-demote
  "C-M-<"              'org-promote-subtree
  "C-M->"              'org-demote-subtree

  "s-k"                'org-insert-link

  "C-M-y"              'org-download-screenshot ; paste
  "C-M-S-y"            'org-download-yank

  ;; Quickly get done Todo states
  ;; This is anti-pattern but efficient
  "H-l"  "C-c C-t d" ; DOING
  "H-k"  "C-c C-t o" ; DONE
  ;; "H-'"

  :niv "s-j"        'org-todo

  :leader "i d"     'gh/org-time-stamp-inactive
  :leader "i c"     'gh/org-insert-checkbox
  :leader "m -"     'org-toggle-item
  :leader "m m S"   'gh/yank-safari-front-url
  :leader "m m s"   'gh/org-insert-safari-front-link

  ;; :leader "a a"   'gh/set-org-agenda-all-files
  ;; :leader "a c"   'gh/set-org-agenda-crowley-files
  )

(map!
    "H-,"         'org-roam-dailies-goto-today
    "H-."         (cmd! (find-file (expand-file-name "daily.org"
                        (expand-file-name org-roam-dailies-directory org-roam-directory))))
    "H-d"         'org-roam-dailies-goto-date
    "H-["         'org-roam-dailies-goto-previous-note
    "H-]"         'org-roam-dailies-goto-next-note

  :leader "SPC"   'org-roam-node-find  ; Also on "s-;"
)

(map! :map org-roam-mode-map
    ;; Add :n to override assignment in +workspaces
        "<f7>"        'org-tags-view
        "<f9>"        'org-agenda-list

        "s-I"         'org-roam-node-insert

    ;; `r` org-roam
    :leader "r i"     'org-roam-node-insert
    :leader "r I"     'org-roam-node-insert-immediate
    :leader "r b"     'org-roam-buffer-toggle
    :leader "r x"     'gh/org-roam-toggle-exclude
)

(map! :map which-key-mode-map
    "M-x <right>"   'which-key-show-next-page-cycle
    "C-x <right>"   'which-key-show-next-page-cycle
    "M-x <left>"   'which-key-show-previous-page-cycle
    "C-x <left>"   'which-key-show-previous-page-cycle

    ;; No further pages here.
    ;; :leader "<right>"   'which-key-show-next-page-cycle
    ;; :leader "<left>"    'which-key-show-previous-page-cycle
    )

(after! ccls
  (setq ccls-executable "~/bin/ccls"
        compile-command (concat "g++ " "\"" (buffer-file-name) "\""))
  (set-lsp-priority! 'ccls 0))

(setq ccls-initialization-options '(:index (:comments 2) :completion (:detailedLabel t)))
;; (define-key c++-mode-map [f5] #'compile)

(defun gh/compile ()
  (interactive)
  (setq compile-command (concat "g++ " "\"" (buffer-file-name) "\""))
  (compile compile-command))


(map! :map cpp-mode-map
  :leader "c c" 'gh/compile
  )
