config.org
*** Elixir and Phoenix
#+begin_src emacs-lisp
(map! :map elixir-mode-map
 :i "M-s-;" (cmd! (insert "-> "))
 :i "M-s-:" (cmd! (insert "<- "))
 :i "s-:"   (cmd! (insert "=> "))
 :i "M-s-." (cmd! (insert "|> "))
 )
#+end_src

*** Haskell
#+begin_src emacs-lisp
(defun  gh/load-and-run ()
  (interactive)
  (haskell-process-load-or-reload)
  (evil-window-next 0)
  ;; (haskell-interactive-mode-history-previous 1)
  )
#+end_src

#+begin_src emacs-lisp
(map! :map haskell-mode-map
 :i "C-M-;" (cmd! (insert "-> "))
 :i "C-M-:" (cmd! (insert "<- "))
 :i "C-M-=" (cmd! (insert "=> "))
 :i "C-M-+" (cmd! (insert "<= "))

 ; Not being scoped to haskell-mode. Why?
 ; :leader "m l" 'gh/load-and-run
 )
 #+end_src

*** Ledger
#+begin_src emacs-lisp
(map! :map ledger-mode-map
      "C-c C-l" 'ledger-mode-clean-buffer
      "C-c C-i" 'gh/ledger-insert-date)
#+end_src

Ledger stores custom reports in =custom.el=, but the file does not persist so losing all reports. This should be set in =custom-set-variables=, but see the note below.  Find a work around.
#+begin_src elisp :tangle no
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
#+end_src

#+begin_src emacs-lisp :tangle no
 '(ledger-reports
   '(
     ("bal" "%(binary) -f %(ledger-file) bal")
     ("reg" "%(binary) -f %(ledger-file) reg")
     ("payee" "%(binary) -f %(ledger-file) reg @%(payee)")
     ("account" "%(binary) -f %(ledger-file) reg %(account)")
     ("Annulment - reg" "ledger [[ledger-mode-flags]] -f /Users/gavinhughes/Library/Mobile\\ Documents/com\\~apple\\~CloudDocs/Dauin\\ Point/Finance/Accounting/ledger/main.ledger reg \"Expense\" and %case=2015-15066")
     ("Annulment - bal" "ledger [[ledger-mode-flags]] -f /Users/gavinhughes/Library/Mobile\\ Documents/com\\~apple\\~CloudDocs/Dauin\\ Point/Finance/Accounting/ledger/main.ledger bal \"Expense\" and %case=2015-15066")
     ("Spec Perf - reg" "ledger [[ledger-mode-flags]] -f /Users/gavinhughes/Library/Mobile\\ Documents/com\\~apple\\~CloudDocs/Dauin\\ Point/Finance/Accounting/ledger/main.ledger reg \"Expense\" and %case=2018-15313")
     ("Spec Perf - Bal" "ledger [[ledger-mode-flags]] -f /Users/gavinhughes/Library/Mobile\\ Documents/com\\~apple\\~CloudDocs/Dauin\\ Point/Finance/Accounting/ledger/main.ledger bal \"Expense\" and %case=2018-15313")
     ))
#+end_src

*** Markdown
#+begin_src emacs-lisp
(map! :map markdown-mode-map
    ;; Make m-dash behavior consistent with Mac.
    "M--" 'undefine

    "M-s-<return>"  'markdown-insert-list-item
 :i "M--" "–"
;; Errors on markdown-insert-list-item
;;  :ni   "s-<return>" (cmd! (evil-open-below 1) (markdown-insert-list-item))
 )
#+end_src
*** Unused
**** Eww
#+begin_src emacs-lisp :tangle no
(after! eww
  ;; (load-directory! "my/eww-mode")
  ;; This has global effect.  How to limit to just eww mode?
  ;; (visual-fill-column-mode t)
  (map! :map eww-mode-map
        "I" #'my/eww-toggle-images
        "M-<return>" 'my-eww-open-in-new-window
        "M-s-[" 'eww-back-url
        "M-s-]" 'eww-forward-url)
        ;; "<s-mouse-1>" 'my-eww-open-in-new-window
  )
#+end_src
**** ESS
#+begin_src emacs-lisp :tangle no
(map! :map inferior-ess-mode
  :n "M-j" "<- "
  )
#+end_src
* Org Mode
** Functions
#+begin_src emacs-lisp
(defun gh/org-time-stamp-inactive ()
  (interactive)
  (org-insert-time-stamp (current-time) nil 1))
#+end_src

#+begin_src emacs-lisp
(defun gh/org-insert-checkbox ()
  "Insert a checkbox list item."
  (interactive)
  (unless (sp-point-in-blank-line)
    (evil-insert-newline-below))
  (insert "- [ ] ")
  (evil-insert-state))
#+end_src
** Config
- Is there a [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#usingloading-local-packages][better way]] to load using packages.el?
#+begin_src emacs-lisp :tangle no
(add-load-path! "my/org-mode")
(require 'org-mac-link)
#+end_src

#+begin_src emacs-lisp
(setq
  org-directory "/Users/gavinhughes/Library/Mobile Documents/iCloud~com~logseq~logseq/Documents/OrgNotes"
  org-archive-location "archive.org::* From %s"
  org-attach-id-dir (concat org-directory "attachments/")
  org-ellipsis " ▼ "
  org-cycle-separator-lines 3
  org-special-ctrl-k t ; What's this?
  ;; Not working 7/13/21
  org-ctrl-k-protect-subtree t
  org-blank-before-new-entry '((heading . nil)
                               (plain-list-item . nil))
  org-appear-trigger 'on-change)
    ;; Other options: https://github.com/awth13/org-appear/blob/master/org-appear.el
#+end_src

- Save org buffers every 5 seconds of idle time. Necessary for Logseq. Without it, I would jump over to Logseq and make edits without first writing changes in the org file resulting in a fork.
#+begin_src emacs-lisp
(setq auto-save-timeout 30)
(add-hook 'auto-save-hook 'org-save-all-org-buffers)
#+end_src
** Literate config
The Doom +literate module will tangle automatically on save. Need to turn this off because:
1. config.org is set to autosave to avoid losing work when using Roam with Logseq;
2. Tangle on autosave will often result in config.el in a broken state during config.org edits.
#+begin_src emacs-lisp
(remove-hook 'org-mode-hook #'+literate-enable-recompile-h)
#+end_src

** Tags
Not used.
#+begin_src emacs-lisp :tangle no
(setq
  org-use-tag-inheritance nil
  org-agenda-use-tag-inheritance nil
  org-tag-alist '((:startgrouptag)
                  ("Interaction")
                  (:grouptags)
                  ("ia")
                  ("{ia#.+}")
                  (:endgrouptag))
 )
#+end_src

** Latex
- =org-format-latex-options= is set in my custom themes.
- Add this as a hack to get the background color correct:
  ="C-u C-u C-c C-x C-l"= Will preview all latex
  ="C-u C-c C-x C-l"= Un-previews all latex.

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-fragtog-mode) ; toggle preview when point enters fragment
#+end_src

*** Ideas
- For a serious editing environment for LaTeX mathematical documents, try [[https://github.com/dandavison/xenops][xenops]].
** File associations
This was working before going literate. Not sure it's even needed.
Open pdfs with emacs.

#+begin_src emacs-lisp :tangle no
;; (setq org-file-apps (delq (assoc "\\.pdf\\'" org-file-apps) org-file-apps))
;; (setcdr (assoc "\\.pdf\\'" org-file-apps) 'emacs)
#+end_src

*** TODO This needs to work in Dired, not Orgs
Better would be PDF Expert. How to do that?
Also want to be able to open Numbers files, currently this dives into the bundle.


** Images
#+begin_src emacs-lisp :tangle no
  ;;Can be set per file with #+STARTUP: ‘inlineimages’ or ‘noinlineimages’
  org-startup-with-inline-images 0
#+end_src

 org-download is not great.
https://github.com/abo-abo/org-download/blob/master/org-download.el

Good guide:
https://zzamboni.org/post/how-to-insert-screenshots-in-org-documents-on-macos/
 Using the 'attach method, files are inserted in the org-attach-id directory under the file property.
 Limitations:
 - Images will not insert unless under a heading.
#+begin_src emacs-lisp
(require 'org-download)
(after! org
  (setq
    org-download-method 'attach
    org-download-timestamp "%Y%m%d-%H%M%S_"
    org-image-actual-width 300
    org-download-delete-image-after-download 1 ; Delete temp image after download
    org-download-screenshot-method "/opt/homebrew/bin/pngpaste %s"
    org-download-annotate-function #'gh/dont-annotate) ; Don't insert any property info above the link.
  )
(defun gh/dont-annotate (link) "")
#+end_src

** More
;; https://www.orgroam.com/manual.html#Org_002droam-Protocol
;; Installed. How to use it? [2021-12-13 Mon]
;; (require 'org-roam-protocol)

#+begin_src emacs-lisp
(use-package! org-mac-link
  ;; Current version of Outlook doesn't support direct links to messages.
    :after org
    :config
    (setq org-mac-grab-Acrobat-app-p nil) ; Disable grabbing from Adobe Acrobat
    (setq org-mac-grab-devonthink-app-p nil) ; Disable grabbinb from DevonThink
    (map! :map org-mode-map          "C-c g"  #'org-mac-grab-link))

;; Logseq
;; (setq org-logseq-dir "~/Library/Mobile Documents/com~apple~CloudDocs/OrgNotes/Roam/")
;; (setq org-agenda-files (directory-files "~/iCloud/OrgNotes" nil "."));;)"~/iCloud/OrgNotes/")
;; (setq org-agenda-inhibit-startup t)
;; (setq org-agenda-dim-blocked-tasks nil)

;; (use-package! org-roam-bibtex
;;   :after org-roam
;;   :config
;;   (require 'org-ref)) ; optional: if Org Ref is not loaded anywhere else, load it here

;; (setq org-roam-capture-templates
;;       '(;; ... other templates
;;         ;; bibliography note template
;;         ("r" "bibliography reference" plain "%?"
;;         :target
;;         (file+head "references/${citekey}.org" "#+title: ${title}\n")
;;         :unnarrowed t)))
#+end_src

#+begin_src emacs-lisp

;; Don't think this required now. [2023-04-30 Sun]
;; (add-hook 'org-mode-hook #'org-appear-mode)

(after! org
  ;; (load-directory! "my/org-mode")
 (vi-tilde-fringe-mode -1)
 (setq
    company-idle-delay nil ;; no autocompletion
    org-hide-emphasis-markers t
    spell-fu-mode nil

    org-todo-keywords
    '(
        (sequence
        "TODO(u)"
        "[ ](c)"
        "|"
        "DOING(d)"
        "ASSIGNED(s)"
        "DONE(o)"
        "[X](x)"
        "CANCELLED(l)"
        )
        (sequence
        "WIP(w)"
        "PENDING(p)"
        "PAUSED(a)"
        "|"
      ))))
#+end_src

* Org Roam
** Config
 [2023-02-26 Sun]
 Added this because
=/Users/gavinhughes/.emacs.d/.local/straight/build-28.2/emacsql/emacsql-sqlite-builtin.el=
calls =require 'sqlite= but fails.
#+begin_src emacs-lisp
(provide 'sqlite)
#+end_src

#+begin_src emacs-lisp
(setq org-roam-v2-ack t)
(setq org-roam-directory org-directory)
(setq org-roam-dailies-directory "journals/")
(org-roam-db-autosync-mode)
#+end_src

Logseq on mobile current solution for accessing Org Roam on mobile. The following module converts notes created with logseq into org-roam nodes. [[https://coredumped.dev/2021/05/26/taking-org-roam-everywhere-with-logseq/][source]]
*** TODO Fix this so it works on startup!
#+begin_src emacs-lisp
;; (after! org-roam (load! "~/.doom.d/modules/org-roam-logseq.el"))
#+end_src
** Daily Template
#+begin_src emacs-lisp
(setq org-roam-dailies-capture-templates '(("d" "default" entry
                                            "* %?"
                                        :target (file+head
"%<%Y-%m-%d>.org"
"#+TITLE: %<%A, %-m/%-d/%y>
#+STARTUP: overview
–––
- [[https://crowley-cpt.deltekenterprise.com/cpweb/cploginform.htm?system=CROWLEYCONFIG][Timesheet]]
- code: VOPAD2
–––
"))))
#+end_src
** Capture Template
#+begin_src emacs-lisp
(setq org-roam-capture-templates
    '(("d" "default" plain "%?"
        :target (file+head "pages/${slug}.org" "#+TITLE:   ${title}\n#+STARTUP: overview\n–")
        :unnarrowed t)))
#+end_src
