config.org
* Org-ai mode
#+begin_src elisp
(org-ai-global-mode 1) ; Make it work everywhere.
(add-hook 'org-mode-hook 'org-ai-mode) ; And always on in org.
; See https://platform.openai.com/docs/models
(setq org-ai-default-chat-model "gpt-3.5-turbo")
(setq org-ai-openai-api-token "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")
#+end_src

The function below is okay, but if I'm using AI in multiple contexts, I would prefer to have each orgai file related only to that context. One way to accomplish this would be to have orgai files named by associated org filename and date. If the buffer is new, then naming by date time would also capture this, but would likely require clean up because these are generally just scratch files.

The other important questions would be, why even save these files? They are useful only for the AI's "memory" (since it doesn't have one). But currently limitation on GPT 3.5 turbo is (I think) 32k tokens.

#+begin_src emacs-lisp
(defun gh/orgai-file-append ()
  "Inserts AI code block at the end of ~/orgai/orgai.org"
  (interactive)
  (setq file "~/orgai/orgai.org")
  (setq cur-window (selected-window))
  (split-window-right)
  (other-window 1)
  (find-file file)
  (goto-char (point-max))
  (newline)
  (insert "#+begin_ai\n[ME]:\n\n#+end_ai")
  (previous-line)
  (evil-insert-state)
  (recenter-top-bottom))
#+end_src

* Experimental
Prune this occasionally.

Open with
https://github.com/garberw/openwith
TODO - not working...
#+begin_src emacs-lisp
(openwith-mode 1)
(setq openwith-associations
            (list
             (list (openwith-make-extension-regexp
                    '("docx" "doc"))
                   "Microsoft Word"
                   '(file))
             ))
#+end_src

#+begin_src emacs-lisp
(add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
(add-hook 'lisp-mode-hook #'enable-paredit-mode)
(add-hook 'paredit-mode-hook (lambda () (evil-paredit-mode +1)))

;; [2023-04-30 Sun]
(add-hook 'org-mode-hook (lambda () (flyspell-mode -1)))
(add-hook 'org-mode-hook (lambda () (flyspell-lazy-mode -1)))

#+end_src

** Functions
https://github.com/hlissner/doom-emacs/issues/581
#+begin_src emacs-lisp :tangle no
(defun dlukes/ediff-doom-config (file)
  "ediff the current config with the examples in doom-emacs-dir

There are multiple config files, so FILE specifies which one to
diff.
"
  (interactive
    (list (read-file-name "Config file to diff: " doom-private-dir)))
  (let* ((stem (file-name-base file))
          (customized-file (format "%s.el" stem))
          (template-file-regex (format "^%s.example.el$" stem)))
    (ediff-files
      (concat doom-private-dir customized-file)
      (car (directory-files-recursively
             doom-emacs-dir
             template-file-regex
             nil
             (lambda (d) (not (string-prefix-p "." (file-name-nondirectory d)))))))))
#+end_src

** ChatGPT
#+begin_src emacs-lisp
(use-package! chatgpt
  :defer t
  :config
  (unless (boundp 'python-interpreter)
    (defvaralias 'python-interpreter 'python-shell-interpreter))
  (setq chatgpt-repo-path (expand-file-name "straight/repos/ChatGPT.el/" doom-local-dir))
  (set-popup-rule! (regexp-quote "*ChatGPT*")
    :side 'bottom :size .5 :ttl nil :quit t :modeline nil)
  :bind ("C-c q" . chatgpt-query))
#+end_src
