config.el

(org-ai-global-mode 1) ; Make it work everywhere.
(add-hook 'org-mode-hook #'org-ai-mode) ; And always on in org.
; See https://platform.openai.com/docs/models
(setq org-ai-default-chat-model "gpt-3.5-turbo")
(setq org-ai-openai-api-token (getenv "OPENAI-API-TOKEN"))

(defun gh/orgai-file-append ()
  "Inserts AI code block at the end of ~/orgai/orgai.org"
  (interactive)
  (setq file "~/orgai/orgai.org")
  (setq cur-window (selected-window))
  (split-window-right)
  (other-window 1)
  (find-file file)
  (goto-char (point-max))
  (newline)
  (insert "#+begin_ai\n[ME]:\n\n#+end_ai")
  (previous-line)
  (evil-insert-state)
  (recenter-top-bottom))

(add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
(add-hook 'lisp-mode-hook #'enable-paredit-mode)
(add-hook 'paredit-mode-hook (lambda () (evil-paredit-mode +1)))

;; [2023-04-30 Sun]
(add-hook 'org-mode-hook (lambda () (flyspell-mode -1)))
(add-hook 'org-mode-hook (lambda () (flyspell-lazy-mode -1)))

(use-package! chatgpt
  :defer t
  :config
  (unless (boundp 'python-interpreter)
    (defvaralias 'python-interpreter 'python-shell-interpreter))
  (setq chatgpt-repo-path (expand-file-name "straight/repos/ChatGPT.el/" doom-local-dir))
  (set-popup-rule! (regexp-quote "*ChatGPT*")
    :side 'bottom :size .5 :ttl nil :quit t :modeline nil)
  :bind ("C-c q" . chatgpt-query))
